Revit 2027 API
Transform1D.OfPoint Method
 Applies the transformation to the 1-dimensional point and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OfPoint(
	double point
)
Public Function OfPoint (
	point As Double
) As Double
public:
double OfPoint(
	double point
)
member OfPoint :
        point : float -> float
Parameters
point Double
 The point to transform.
Return Value
Double
 The transformed point.
Remarks
 Transformation of a point is affected by the translational part of the transformation.
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace